public/InterfaceStats_origen.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Header>
      <header xmlns="xmlapi_1.0">
         <security>
            <user>C12285</user>
            <password hashed="false">Peru2018#</password>
         </security>
         <requestID>aquiroga:0001</requestID>
      </header>
   </SOAP:Header>

   <SOAP:Body>
      <find xmlns="xmlapi_1.0">
         <fullClassName>equipment.InterfaceAdditionalStatsLogRecord</fullClassName>
         <filter>
           <and>
            <or>
            </or>
            <or>
              <wildcard name="monitoredObjectSiteName" value="%CSR%"/>
              <wildcard name="monitoredObjectSiteName" value="%AN0%"/>
              <wildcard name="monitoredObjectSiteName" value="%DN0%"/>
              <wildcard name="monitoredObjectSiteName" value="%CN0%"/>
            </or>
            <not>
             <or>
              <wildcard name="displayedName" value="Channel%"/>
              <wildcard name="displayedName" value="system%"/>
              <wildcard name="displayedName" value="loopback%"/>
             </or>
            </not>
            <and>
             <notEqual name="receivedTotalOctetsPeriodic" value="0"/>
             <notEqual name="transmittedTotalOctetsPeriodic" value="0"/>
            </and>
          </and>
         </filter>
         <resultFilter>
            <attribute>receivedTotalOctetsPeriodic</attribute>
            <attribute>transmittedTotalOctetsPeriodic</attribute>
            <attribute>monitoredObjectSiteName</attribute>
            <attribute>displayedName</attribute>
            <attribute>timeCaptured</attribute>
            <attribute>periodicTime</attribute>
            <children/>
         </resultFilter>
      </find>
   </SOAP:Body>

</SOAP:Envelope>
